MORSE_DICT = {
    "А": ".-",
    "Б": "-...",
    "В": ".--",
    "Г": "--.",
    "Д": "-..",
    "Е": ".",
    "Ж": "...-",
    "З": "--..",
    "И": "..",
    "Й": ".---",
    "К": "-.-",
    "Л": ".-..",
    "М": "--",
    "Н": "-.",
    "О": "---",
    "П": ".--.",
    "Р": ".-.",
    "С": "...",
    "Т": "-",
    "У": "..-",
    "Ф": "..-.",
    "Х": "....",
    "Ц": "-.-.",
    "Ч": "---.",
    "Ш": "----",
    "Щ": "--.-",
    "Ъ": "--.--",
    "Ы": "-.--",
    "Ь": "-..-",
    "Э": "..-..",
    "Ю": "..--",
    "Я": ".-.-",
    " ": " ",
    "1": ".----",
    "2": "..---",
    "3": "...--",
    "4": "....-",
    "5": ".....",
    "6": "-....",
    "7": "--...",
    "8": "---..",
    "9": "----.",
    "0": "-----",
    ".": ".-.-.-",
    ",": "--..--",
    ":": "---...",
    ";": "-.-.-.",
    "(": "-.--.",
    ")": "-.--.-",
    "?": "..--..",
    "!": "-.-.--",
    "=": "-...-",
    "+": ".-.-.",
    "-": "-....-",
    "/": "-..-.",
    "$": "...-..-",
    "@": ".--.-.",
    "&": ".-...",
    "¡": "--...-",
    "_": "..--.-",
    '"': ".-..-.",
    "¿": "..-.-",
    "'": ".----.",
}

MORSE_DICT_REVERSED = {value: key for key, value in MORSE_DICT.items()}


def encode(text):
    splited_text = [[i for i in word] for word in text.split()]
    return "  ".join(
        [
            " ".join(
                [MORSE_DICT.get(letter.upper(), letter) for letter in word])
            for word in splited_text
        ]
    )


def decode(text):
    encoded_words = text.split("  ")
    return " ".join(["".join(
        [MORSE_DICT_REVERSED.get(i, i) for i in word.split()]).lower()
        for word in encoded_words]
    )
